<?php
$data = [
['Nick' => [
    'Товары' => [
        [
            'Наименование' => 'Бетон',
            'Цена' => 100,
        ],
        [
            'Наименование' => 'Герб',
            'Цена' => 150,
        ],
    ],
],
'Город' => 'Москва',
'Доставка' => 'Да',
],
['Чебурашка' => [
    'Товары' => [

    ],
],
'Город' => 'Челябинск',
'Доставка' => 'Нет',
],
['Black' => [
    'Товары' => [
        [
            'Наименование' => 'Квадрат',
            'Цена' => 799,
        ],
    ],
],
'Город' => 'Москва',
'Доставка' => 'Да',
],
];
print_r ($data);