<?php
$data = [
    'Мастера' => [
        [
            'Никнейм' => 'Nick',
            'Город' => 'Москва',
            'Доставка' => 'Да',
            'Товары' => [
                [
                    'Наименование' => 'Бетон',
                    'Цена' => '100',
                    'Мастер' => 'Nick',
                ],
                [
                    'Наименование' => 'Герб',
                    'Цена' => '150',
                    'Мастер' => 'Nick',
                ],
            ],
        ],
        [
            'Никнейм' => 'Чебурашка',
            'Город' => 'Челябинск',
            'Доставка' => 'Нет',
            'Товары' => [
            ],
        ],
        [
            'Никнейм' => 'Black',
            'Город' => 'Казань',
            'Доставка' => 'Нет',
            'Товары' => [
                [
                    'Наименование' => 'Квадрат',
                    'Цена' => '799',
                    'Мастер' => 'Black',
                ],
            ],
        ],
    ],
];
print_r ($data);