<?php
$data = [
    'Мастера' => [
        1 => [
            'id' => 1,
            'Никнейм' => 'Nick',
            'Город' => 'Москва',
            'Доставка' => 'Да',
        ],
        2 => [
            'id' => 2,
            'Никнейм' => 'Чебурашка',
            'Город' => 'Челябинск',
            'Доставка' => 'Нет',
        ],
        3 => [
            'id' => 3,
            'Никнейм' => 'Black',
            'Город' => 'Казань',
            'Доставка' => 'Нет',
        ],
    ],
    'Товары' => [
        [
            'Наименование' => 'Бетон',
            'Цена' => 100,
            'Мастер' => 1,
        ],
        [
            'Наименование' => 'Герб',
            'Цена' => 150,
            'Мастер' => 1,
        ],
        [
            'Наименование' => 'Квадрат',
            'Цена' => 799,
            'Мастер' => 3,
        ]
    ],
];